Tekla Open API Reference for Tekla Structures 2025
GeometrySectionEnumerator.Reset Method
 Resets the enumerator to the beginning.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void Reset()
Public Sub Reset
Implements
IEnumerator.Reset()
See Also
Reference
GeometrySectionEnumerator Class
Tekla.Structures.Model Namespace